Радченко_на_EDT_Project/src/Reports/ДиаграммаНачислений/ДиаграммаНачислений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ДиаграммаНачислений</name>
</mdclass:Report>

Радченко_на_EDT_Project/src/CalculationRegisters/Начисления/Начисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>Начисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ГрафикиРаботы</schedule>
  <scheduleValue>InformationRegister.ГрафикиРаботы.Resource.Значение</scheduleValue>
  <scheduleDate>InformationRegister.ГрафикиРаботы.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВидыГрафиковРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходныеДанные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
    <baseDimension>true</baseDimension>
  </dimensions>
  <recalculations>
    <name>Перерасчет</name>
    <dimensions>
      <name>Сотрудник</name>
    </dimensions>
  </recalculations>
</mdclass:CalculationRegister>

Радченко_на_EDT_Project/src/ChartsOfCalculationTypes/ОсновныеНачисления/ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ОсновныеНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ОсновныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>Невыход</name>
      <description>Невыход</description>
    </items>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>Премия</name>
      <description>Премия</description>
    </items>
  </predefined>
</mdclass:ChartOfCalculationTypes>

Радченко_на_EDT_Project/src/Reports/ДиаграммаНачислений/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере(ДиаграммаГанта);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СформироватьНаСервере(Диаграмма)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НачисленияФактическийПериодДействия.Сотрудник,
		|	НачисленияФактическийПериодДействия.ВидРасчета,
		|	НачисленияФактическийПериодДействия.ПериодДействияНачало,
		|	НачисленияФактическийПериодДействия.ПериодДействияКонец,
		|	НачисленияФактическийПериодДействия.Результат,
		|	НачисленияФактическийПериодДействия.Регистратор,
		|	НачисленияФактическийПериодДействия.Регистратор.Представление
		|ИЗ
		|	РегистрРасчета.Начисления.ФактическийПериодДействия КАК НачисленияФактическийПериодДействия";
	
	ВыборкаРезультата = Запрос.Выполнить().Выбрать();
	
	// Запретить обновление диаграммы.
	Диаграмма.Обновление = Ложь;
	
	Диаграмма.Очистить();
	
	Пока ВыборкаРезультата.Следующий() Цикл
		
		ТекущаяСерия = Диаграмма.УстановитьСерию(ВыборкаРезультата.ВидРасчета);
		ТекущаяТочка = Диаграмма.УстановитьТочку(ВыборкаРезультата.Сотрудник);
		ТекущееЗначение = Диаграмма.ПолучитьЗначение(ТекущаяТочка, ТекущаяСерия);
		
		ТекущийИнтервал = ТекущееЗначение.Добавить();
		ТекущийИнтервал.Начало = ВыборкаРезультата.ПериодДействияНачало;
		ТекущийИнтервал.Конец = ВыборкаРезультата.ПериодДействияКонец;
		ТекущийИнтервал.Текст = ВыборкаРезультата.РегистраторПредставление;
		ТекущийИнтервал.Расшифровка = ВыборкаРезультата.Регистратор;		
		
	КонецЦикла;
	
	// Раскрасить серии своими цветами.
	Для Каждого Серия Из Диаграмма.Серии Цикл
		
		Если Серия.Значение = ПланыВидовРасчета.ОсновныеНачисления.Оклад Тогда
			Серия.Цвет = WebЦвета.Желтый;
		ИначеЕсли Серия.Значение = ПланыВидовРасчета.ОсновныеНачисления.Премия Тогда
			Серия.Цвет = WebЦвета.Зеленый;
		ИначеЕсли Серия.Значение = ПланыВидовРасчета.ОсновныеНачисления.Невыход Тогда
			Серия.Цвет = WebЦвета.Красный;
		КонецЕсли;
		
	КонецЦикла;
	
	Диаграмма.Обновление = Истина;
	
КонецПроцедуры
